In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

### 1.

In [14]:
distinct_last_names = pd.read_sql_query('SELECT *, COUNT(last_name) AS repetition \
FROM sakila.actor \
GROUP BY last_name \
HAVING repetition = 1', engine)
print(distinct_last_names.shape)
distinct_last_names.head()

(66, 5)

   actor_id first_name  last_name         last_update  repetition
0        76   ANGELINA    ASTAIRE 2006-02-15 04:34:33           1
1       112    RUSSELL     BACALL 2006-02-15 04:34:33           1
2       115   HARRISON       BALE 2006-02-15 04:34:33           1
3       187      RENEE       BALL 2006-02-15 04:34:33           1
4        47      JULIA  BARRYMORE 2006-02-15 04:34:33           1